{"data":{"markdownRemark":{"html":"<p>A few weeks ago, James from <a href=\"https://www.northcoders.com\">Northcoders</a> put out an open invitation to the Northcoders WiT community for speakers to follow his opening keynote speech at the <a href=\"https://dwpdigital.blog.gov.uk/2018/05/30/introducing-our-second-women-in-digital-event/\">DWP Women in Digital conference</a> in Leeds. He hoped a few of us could talk about our journeys into coding, to further illustrate the good work Northcoders already do in getting women into technology careers. I immediately volunteered, for two reasons. Firstly, being a Northcoder has absolutely turned my life around, and I will take any opportunity to tell people how supportive and encouraging the Northcoders community is. Secondly, I have a certain history with the DWP, and I figured it might be time to face down an old demon or two. (Disclaimer: I did not meet anyone in the least bit demonic that day. My issues are with the policymakers, not with the people on the ground.)</p>\n<p><a href=\"https://dwpdigital.blog.gov.uk/2018/06/18/guest-post-changing-workplace-dynamics/\">DWP Digital guest post by James: Changing workplace dynamics</a></p>\n<p>Going into this, I had a good idea of the sort of impact James’ keynote would have on the conference. He’s passionate about gender equality and diversity not just in the tech world but in the workplace full stop. I wouldn’t have been able to become a Northcoder if it hadn’t been for their Women in Tech scholarships. I think the statement James made about diffusion of responsibility gave the whole audience food for thought - our efforts may seem tiny and insignificant, but they are part of a massive whole and we can, in fact, have a great influence when we pull together.</p>\n<p>“No snowflake feels responsible in an avalanche.” – Voltaire</p>\n<p>What I wasn’t prepared for, however, was the impact that <a href=\"https://twitter.com/emily_walker_96\">Emily</a>, <a href=\"https://twitter.com/BernieSnell\">Bernie</a> and I would have on the day. I had no idea that sharing our stories would be so powerful. Emily talked about how imposter syndrome affects us all. Bernie shared the importance of seeing people like ourselves succeeding at what we want to do. And I, in terrified demon-fighting form, spoke for the first time in public about the impact domestic abuse had on me, and why having a community telling you “yes, you can” is so vital.</p>\n<p>“Stand before the people you fear and speak your mind - even if your voice shakes.” – Maggie Kuhn</p>\n<p>The rest of the morning was full of good stories coming out of the women-in-tech world. <a href=\"https://twitter.com/amandaneylon\">Amanda Neylon</a> showed us the great work that our wonderful NHS is doing to promote inclusion and accessibility. Sumit Mistry and <a href=\"https://twitter.com/cfidurauk\">Christie Fidura</a> explained the ‘ohana’ ethic at Salesforce, and showcased their <a href=\"https://trailhead.salesforce.com/en/trailblazers\">Trailblazers</a>. During the following panel discussion with Christie, Amanda and our own <a href=\"https://twitter.com/AlannaIllo\">Alanna</a>, Christie mentioned me by name at one point, which was a hugely humbling moment. Going from a moment where I talked about my voice being taken away to a moment where somebody recognised and amplified my voice was just… mindblowing.</p>\n<p>I wish I had a Hogwarts-style time turner so that I could have attended all the breakout sessions in the afternoon, especially the sessions on neurodiversity and the LGBT+ community. One point that got raised in the session on intersectionality and BAME, headed up by <a href=\"https://twitter.com/Tia_Priest\">Tia Priest</a>, really summed up the day for me: People aren’t statistics or labels. We’re complex beings with unique stories, and sharing those stories helps us to understand each other more. Reducing someone down to their “otherness” from ourselves is counterproductive. We all have far more in common than we do at first glance.</p>\n<p>I don’t know if or how sharing my own story will continue to have an impact beyond the conference. But what I do know is that next time I share my story, my voice will shake a little less.</p>\n<p>I want to thank everyone that attended that day for making the event the inspiration that it was. I hope I’ve managed to follow everyone who tweeted about it! It’s my hope that we women of the digital world continue to be the role models that women of the future need to see.</p>\n<p>“Feel the fear and do it anyway.” – Susan Jeffers</p>\n<p><a href=\"https://twitter.com/i/moments/1009365383567020034\">DWPWID Twitter moment</a></p>","frontmatter":{"title":"DWP Women in Digital","date":"21 June, 2018","featuredImage":null},"fields":{"slug":"/dwp-women-in-digital/"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/dwp-women-in-digital/"}}