{"data":{"markdownRemark":{"html":"<p><code>.reduce()</code> is the Swiss army knife of array manipulation. We use this function to  transform an array into anything we want, be it a single value, another array, or an object. Yet it can be really hard for folks new to JavaScript to get their heads around. I know that I really struggled with it until I saw some really simple examples, and from then onwards every kata I did ended up with me saying “stick a reduce on it, bosh”.</p>\n<p>To reduce an array, you need two things: a reducer function, and an initial value for your end result. Rather than try to explain these, let’s just jump into an example.</p>\n<pre><code class=\"language-js\">let nums = [1,2,3,4,5];\nlet sum = nums.reduce(function(accumulator, num) {\nreturn accumulator + num;\n}, 0)\n</code></pre>\n<p>We’ve got an array, nums, and a function, <code>sum</code>, that runs <code>.reduce</code> on nums to add its contents into one value. You’ll see that <code>.reduce()</code> takes those two arguments I mentioned: the  function that does the reducing, and the initial value for the end result – what we call the accumulator. The accumulator begins as 0, which tells us that our end result is going to be a number.</p>\n<p>But wait! Did you spot the word accumulator in the function? It’s the first argument in the reducer function! This is necessary for every reduce function – the first argument in the reducer function must be the accumulator, even if you don’t name it that. I recommend that for your first few reduce functions, you call it ‘acc’ – it’s easier to type, and you know exactly what it stands for.</p>\n<p>How about that second argument in the reducer function? The second argument in the reducer function refers to each value in the array. What <code>.reduce()</code> will do is iterate through the array, and run each value through the reducer function. Our function here returns the sum of the accumulator, whatever state it’s in at this point in the <code>.reduce()</code> process, and the item currently being processed. Let’s break it down.</p>\n<p>The accumulator starts at 0. Our first value 1 comes into the function and gets added to the accumulator. Now the accumulator is 1. Our next value 2 gets added to the accumulator, so now the accumulator is at 3. Once the reduce function is finished with 5, there are no more values in the array, so the accumulator’s final value, 15, is returned.</p>\n<p>Let’s look at another reduce function that works on our nums array.</p>\n<pre><code class=\"language-js\">let doubles = nums.reduce(function (acc, num) {\nacc.push(num * 2);\nreturn acc;\n}, [])\n</code></pre>\n<p>This time, our accumulator is an array. Each iteration of the reducer function will push a new value into that array, so our resulting array will be the same length as nums. The reducer function pushes the double of each num into the accumulator, so we expect this function to return <code>[2,4,6,8,10]</code>.</p>\n<p>Incidentally, there’s a very good reason why we can’t just use <code>return acc.push(num * 2)</code> in the reducer function. It’s because <code>.push()</code> would return the length of the nums array, which is absolutely not what we want.</p>\n<p>One more example!</p>\n<pre><code class=\"language-js\">let evens = nums.reduce(function (acc, num) {\nif (num % 2 === 0) {\nacc.push(num * 2);\n}\nreturn acc;\n}, []);\n</code></pre>\n<p>Our result will be an array again, but this time it will only contain even numbers – <code>[2,4]</code>. Reduces can and do get far more complicated than these examples, but this should give you an idea of what <code>.reduce()</code> can do to make your coding life easier. Now go stick a reduce on it. Bosh.</p>","frontmatter":{"title":"Reduce It or Lose It","date":"17 October, 2017"},"fields":{"slug":"/reduce-it-or-lose-it/"}}},"pageContext":{"slug":"/reduce-it-or-lose-it/"}}